xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_ll_gpio.h
/** @defgroup GPIO_LL_EC_SPEED Output Speed
  * @{
  */
#define LL_GPIO_SPEED_FREQ_LOW             (0x00000000U)          /*!< Select I/O low output speed    */
#define LL_GPIO_SPEED_FREQ_MEDIUM          GPIO_OSPEEDR_OSPEED0_0 /*!< Select I/O medium output speed */
#define LL_GPIO_SPEED_FREQ_HIGH            GPIO_OSPEEDR_OSPEED0_1 /*!< Select I/O high output speed   */
#define LL_GPIO_SPEED_FREQ_VERY_HIGH       GPIO_OSPEEDR_OSPEED0   /*!< Select I/O very high output speed   */
/**
  * @}
  */

/** @defgroup GPIO_LL_EC_PULL Pull Up Pull Down
  * @{
  */
#define LL_GPIO_PULL_NO                    (0x00000000U)      /*!< Select I/O no pull */
#define LL_GPIO_PULL_UP                    GPIO_PUPDR_PUPD0_0 /*!< Select I/O pull up */
#define LL_GPIO_PULL_DOWN                  GPIO_PUPDR_PUPD0_1 /*!< Select I/O pull down */
/**
  * @}
  */

/** @defgroup GPIO_LL_EC_AF Alternate Function
  * @{
  */
#define LL_GPIO_AF_0                       (0x0000000U) /*!< Select alternate function 0 */
#define LL_GPIO_AF_1                       (0x0000001U) /*!< Select alternate function 1 */
#define LL_GPIO_AF_2                       (0x0000002U) /*!< Select alternate function 2 */
#define LL_GPIO_AF_3                       (0x0000003U) /*!< Select alternate function 3 */
#define LL_GPIO_AF_4                       (0x0000004U) /*!< Select alternate function 4 */
#define LL_GPIO_AF_5                       (0x0000005U) /*!< Select alternate function 5 */
#define LL_GPIO_AF_6                       (0x0000006U) /*!< Select alternate function 6 */
#define LL_GPIO_AF_7                       (0x0000007U) /*!< Select alternate function 7 */
#define LL_GPIO_AF_8                       (0x0000008U) /*!< Select alternate function 8 */
#define LL_GPIO_AF_9                       (0x0000009U) /*!< Select alternate function 9 */
#define LL_GPIO_AF_10                      (0x000000AU) /*!< Select alternate function 10 */
#define LL_GPIO_AF_11                      (0x000000BU) /*!< Select alternate function 11 */
#define LL_GPIO_AF_12                      (0x000000CU) /*!< Select alternate function 12 */
#define LL_GPIO_AF_13                      (0x000000DU) /*!< Select alternate function 13 */
#define LL_GPIO_AF_14                      (0x000000EU) /*!< Select alternate function 14 */
#define LL_GPIO_AF_15                      (0x000000FU) /*!< Select alternate function 15 */

/**
  * @}
  */

/** @defgroup GPIO_LL_Alternate_function_selection Alternate function selection
  * @{
  */

/**
  * @brief   AF 0 selection
  */

#define LL_GPIO_AF0_TIM1          LL_GPIO_AF_0   /*!< TIM1   Alternate Function mapping */
#define LL_GPIO_AF0_TIM15         LL_GPIO_AF_0   /*!< TIM15  Alternate Function mapping */
#define LL_GPIO_AF0_TIM2          LL_GPIO_AF_0   /*!< TIM2   Alternate Function mapping */
#define LL_GPIO_AF0_USART1        LL_GPIO_AF_0   /*!< USART1 Alternate Function mapping */
#define LL_GPIO_AF0_LPTIM2        LL_GPIO_AF_0   /*!< LPTIM2 Alternate Function mapping */
#define LL_GPIO_AF0_SWJ           LL_GPIO_AF_0   /*!< SWJ    Alternate Function mapping */
#define LL_GPIO_AF0_MCO           LL_GPIO_AF_0   /*!< MCO    Alternate Function mapping */
#define LL_GPIO_AF0_TIM16         LL_GPIO_AF_0   /*!< TIM16  Alternate Function mapping */
#define LL_GPIO_AF0_PWM           LL_GPIO_AF_0   /*!< PWM    Alternate Function mapping */
#define LL_GPIO_AF0_LPTIM1        LL_GPIO_AF_0   /*!< LPTIM1 Alternate Function mapping */
#define LL_GPIO_AF0_TIM3          LL_GPIO_AF_0   /*!< TIM3   Alternate Function mapping */
#define LL_GPIO_AF0_I2C1          LL_GPIO_AF_0   /*!< I2C1   Alternate Function mapping */
#define LL_GPIO_AF0_SPI2          LL_GPIO_AF_0   /*!< SPI2   Alternate Function mapping */
#define LL_GPIO_AF0_I2S2          LL_GPIO_AF_0   /*!< I2S2   Alternate Function mapping */

/**
  * @brief   AF 1 selection
  */
#define LL_GPIO_AF1_TIM1          LL_GPIO_AF_1   /*!< TIM1   Alternate Function mapping */
#define LL_GPIO_AF1_LPTIM2        LL_GPIO_AF_1   /*!< LPTIM2 Alternate Function mapping */
#define LL_GPIO_AF1_TIM15         LL_GPIO_AF_1   /*!< TIM15  Alternate Function mapping */
#define LL_GPIO_AF1_USART1        LL_GPIO_AF_1   /*!< USART1 Alternate Function mapping */
#define LL_GPIO_AF1_LPTIM1        LL_GPIO_AF_1   /*!< LPTIM1 Alternate Function mapping */
#define LL_GPIO_AF1_I2C1          LL_GPIO_AF_1   /*!< I2C1   Alternate Function mapping */
#define LL_GPIO_AF1_PWM           LL_GPIO_AF_1   /*!< PWM    Alternate Function mapping */
#define LL_GPIO_AF1_UART1         LL_GPIO_AF_1   /*!< UART1  Alternate Function mapping */
#define LL_GPIO_AF1_TIM2          LL_GPIO_AF_1   /*!< TIM2   Alternate Function mapping */
#define LL_GPIO_AF1_SPI1          LL_GPIO_AF_1   /*!< SPI1   Alternate Function mapping */
#define LL_GPIO_AF1_I2S1          LL_GPIO_AF_1   /*!< I2S1   Alternate Function mapping */
#define LL_GPIO_AF1_TIM16         LL_GPIO_AF_1   /*!< TIM16  Alternate Function mapping */
#define LL_GPIO_AF1_TIM3          LL_GPIO_AF_1   /*!< TIM3   Alternate Function mapping */
#define LL_GPIO_AF1_SPI2          LL_GPIO_AF_1   /*!< SPI2   Alternate Function mapping */
#define LL_GPIO_AF1_I2S2          LL_GPIO_AF_1   /*!< I2S2   Alternate Function mapping */
#define LL_GPIO_AF1_USART2        LL_GPIO_AF_1   /*!< USART2 Alternate Function mapping */
#define LL_GPIO_AF1_TIM17         LL_GPIO_AF_1   /*!< TIM17  Alternate Function mapping */

/**
  * @brief   AF 2 selection
  */
#define LL_GPIO_AF2_LPTIM1        LL_GPIO_AF_2   /*!< LPTIM1  Alternate Function mapping */
#define LL_GPIO_AF2_TIM16         LL_GPIO_AF_2   /*!< TIM16   Alternate Function mapping */
#define LL_GPIO_AF2_TIM15         LL_GPIO_AF_2   /*!< TIM15   Alternate Function mapping */
#define LL_GPIO_AF2_USART1        LL_GPIO_AF_2   /*!< USART1  Alternate Function mapping */
#define LL_GPIO_AF2_I2C1          LL_GPIO_AF_2   /*!< I2C1    Alternate Function mapping */
#define LL_GPIO_AF2_UART1         LL_GPIO_AF_2   /*!< UART1   Alternate Function mapping */
#define LL_GPIO_AF2_LPTIM2        LL_GPIO_AF_2   /*!< LPTIM2  Alternate Function mapping */
#define LL_GPIO_AF2_TIM2          LL_GPIO_AF_2   /*!< TIM2    Alternate Function mapping */
#define LL_GPIO_AF2_TIM1          LL_GPIO_AF_2   /*!< TIM1    Alternate Function mapping */
#define LL_GPIO_AF2_SPI1          LL_GPIO_AF_2   /*!< SPI1    Alternate Function mapping */
#define LL_GPIO_AF2_I2S1          LL_GPIO_AF_2   /*!< I2S1    Alternate Function mapping */
#define LL_GPIO_AF2_TIM3          LL_GPIO_AF_2   /*!< TIM3    Alternate Function mapping */
#define LL_GPIO_AF2_SPI2          LL_GPIO_AF_2   /*!< SPI2    Alternate Function mapping */
#define LL_GPIO_AF2_I2S2          LL_GPIO_AF_2   /*!< I2S2    Alternate Function mapping */
#define LL_GPIO_AF2_USART2        LL_GPIO_AF_2   /*!< USART2  Alternate Function mapping */
#define LL_GPIO_AF2_PWM           LL_GPIO_AF_2   /*!< PWM     Alternate Function mapping */
#define LL_GPIO_AF2_LPUART1       LL_GPIO_AF_2   /*!< LPUART1 Alternate Function mapping */
#define LL_GPIO_AF2_I2C2          LL_GPIO_AF_2   /*!< I2C2    Alternate Function mapping */
#define LL_GPIO_AF2_TIM17         LL_GPIO_AF_2   /*!< TIM17   Alternate Function mapping */

/**
  * @brief   AF 3 selection
  */
#define LL_GPIO_AF3_LPTIM1        LL_GPIO_AF_3   /*!< AF3: LPTIM1  Alternate Function mapping */
#define LL_GPIO_AF3_TIM15         LL_GPIO_AF_3   /*!< AF3: TIM15   Alternate Function mapping */
#define LL_GPIO_AF3_TIM2          LL_GPIO_AF_3   /*!< AF3: TIM2    Alternate Function mapping */
#define LL_GPIO_AF3_I2C1          LL_GPIO_AF_3   /*!< AF3: I2C1    Alternate Function mapping */
#define LL_GPIO_AF3_I2C2          LL_GPIO_AF_3   /*!< AF3: I2C2    Alternate Function mapping */
#define LL_GPIO_AF3_TIM2          LL_GPIO_AF_3   /*!< AF3: TIM2    Alternate Function mapping */
#define LL_GPIO_AF3_LPUART1       LL_GPIO_AF_3   /*!< AF3: LPUART1 Alternate Function mapping */
#define LL_GPIO_AF3_SPI2          LL_GPIO_AF_3   /*!< AF3: SPI2    Alternate Function mapping */
#define LL_GPIO_AF3_I2S2          LL_GPIO_AF_3   /*!< AF3: I2S2    Alternate Function mapping */
#define LL_GPIO_AF3_TIM1          LL_GPIO_AF_3   /*!< AF3: TIM1    Alternate Function mapping */
#define LL_GPIO_AF3_UART1         LL_GPIO_AF_3   /*!< AF3: UART1   Alternate Function mapping */
#define LL_GPIO_AF3_USART1        LL_GPIO_AF_3   /*!< AF3: USART1  Alternate Function mapping */
#define LL_GPIO_AF3_USART2        LL_GPIO_AF_3   /*!< AF3: USART2  Alternate Function mapping */
/**
  * @brief   AF 4 selection
  */
#define LL_GPIO_AF4_I2C1          LL_GPIO_AF_4   /*!< I2C1   Alternate Function mapping */
#define LL_GPIO_AF4_I2C2          LL_GPIO_AF_4   /*!< I2C2   Alternate Function mapping */
#define LL_GPIO_AF4_SPI2          LL_GPIO_AF_4   /*!< SPI2   Alternate Function mapping */
#define LL_GPIO_AF4_I2S2          LL_GPIO_AF_4   /*!< I2S2   Alternate Function mapping */
#define LL_GPIO_AF4_TIM1          LL_GPIO_AF_4   /*!< TIM1   Alternate Function mapping */
#define LL_GPIO_AF4_TIM2          LL_GPIO_AF_4   /*!< TIM2   Alternate Function mapping */
#define LL_GPIO_AF4_SPI1          LL_GPIO_AF_4   /*!< SPI1   Alternate Function mapping */
#define LL_GPIO_AF4_I2S1          LL_GPIO_AF_4   /*!< I2S1   Alternate Function mapping */
#define LL_GPIO_AF4_LPTIM2        LL_GPIO_AF_4   /*!< LPTIM2 Alternate Function mapping */
#define LL_GPIO_AF4_USART1        LL_GPIO_AF_4   /*!< USART1 Alternate Function mapping */
#define LL_GPIO_AF4_USART2        LL_GPIO_AF_4   /*!< USART2 Alternate Function mapping */
#define LL_GPIO_AF4_UART1         LL_GPIO_AF_4   /*!< UART1  Alternate Function mapping */

/**
  * @brief   AF 5 selection
  */
#define LL_GPIO_AF5_I2C2          LL_GPIO_AF_5   /*!< I2C2   Alternate Function mapping */
#define LL_GPIO_AF5_SPI1          LL_GPIO_AF_5   /*!< SPI1   Alternate Function mapping */
#define LL_GPIO_AF5_I2S1          LL_GPIO_AF_5   /*!< I2S1   Alternate Function mapping */
#define LL_GPIO_AF5_I2C1          LL_GPIO_AF_5   /*!< I2C1   Alternate Function mapping */
#define LL_GPIO_AF5_LPTIM2        LL_GPIO_AF_5   /*!< LPTIM2 Alternate Function mapping */
#define LL_GPIO_AF5_LPTIM1        LL_GPIO_AF_5   /*!< LPTIM1 Alternate Function mapping */

/**
  * @brief   AF 6 selection
  */
#define LL_GPIO_AF6_I2C2          LL_GPIO_AF_6   /*!< I2C2  Alternate Function mapping */
#define LL_GPIO_AF6_SPI1          LL_GPIO_AF_6   /*!< SPI1  EVENTOUT Alternate Function mapping  */
#define LL_GPIO_AF6_I2S1          LL_GPIO_AF_6   /*!< I2S1  Alternate Function mapping */
#define LL_GPIO_AF6_I2C1          LL_GPIO_AF_6   /*!< I2C1  Alternate Function mapping */
#define LL_GPIO_AF6_FDCAN         LL_GPIO_AF_6   /*!< FDCAN Alternate Function mapping */

/**
  * @brief   AF 7 selection
  */
#define LL_GPIO_AF7_TIM1          LL_GPIO_AF_7   /*!< TIM1 Alternate Function mapping */
#define LL_GPIO_AF7_PWM           LL_GPIO_AF_7   /*!< PWM  Alternate Function mapping */
#define LL_GPIO_AF7_I2C2          LL_GPIO_AF_7   /*!< I2C2 Alternate Function mapping */
/**
  * @brief   AF 8 selection
  */
#define LL_GPIO_AF8_LPTIM2        LL_GPIO_AF_8   /*!< LPTIM2 Alternate Function mapping */
#define LL_GPIO_AF8_TIM15         LL_GPIO_AF_8   /*!< TIM15  Alternate Function mapping */
#define LL_GPIO_AF8_TIM1          LL_GPIO_AF_8   /*!< TIM1   Alternate Function mapping */
#define LL_GPIO_AF8_I2C2          LL_GPIO_AF_8   /*!< I2C2   Alternate Function mapping */
#define LL_GPIO_AF8_USART1        LL_GPIO_AF_8   /*!< USART1 Alternate Function mapping */
#define LL_GPIO_AF8_UART2         LL_GPIO_AF_8   /*!< UART2  Alternate Function mapping */
#define LL_GPIO_AF8_LPTIM1        LL_GPIO_AF_8   /*!< LPTIM1 Alternate Function mapping */
/**
  * @brief   AF 9 selection
  */
#define LL_GPIO_AF9_LPTIM1        LL_GPIO_AF_9  /*!< LPTIM1 Alternate Function mapping */
#define LL_GPIO_AF9_TIM15         LL_GPIO_AF_9  /*!< TIM15  Alternate Function mapping */
#define LL_GPIO_AF9_COMP2         LL_GPIO_AF_9  /*!< COMP2  Alternate Function mapping */
#define LL_GPIO_AF9_TIM2          LL_GPIO_AF_9  /*!< TIM2   Alternate Function mapping */
#define LL_GPIO_AF9_COMP1         LL_GPIO_AF_9  /*!< COMP1  Alternate Function mapping */
#define LL_GPIO_AF9_I2C2          LL_GPIO_AF_9  /*!< I2C2   Alternate Function mapping */
#define LL_GPIO_AF9_UART2         LL_GPIO_AF_9  /*!< UART2  Alternate Function mapping */
#define LL_GPIO_AF9_PWM           LL_GPIO_AF_9  /*!< PWM    Alternate Function mapping */
#define LL_GPIO_AF9_TIM1          LL_GPIO_AF_9  /*!< TIM1   Alternate Function mapping */
/**
  * @brief   AF 10 selection
  */
#define LL_GPIO_AF10_TIM1         LL_GPIO_AF_10  /*!< TIM1    Alternate Function mapping */
#define LL_GPIO_AF10_USART1       LL_GPIO_AF_10  /*!< USART1  Alternate Function mapping */
#define LL_GPIO_AF10_USART2       LL_GPIO_AF_10  /*!< USART2  Alternate Function mapping */
#define LL_GPIO_AF10_LPUART1      LL_GPIO_AF_10  /*!< LPUART1 Alternate Function mapping */
#define LL_GPIO_AF10_UART2        LL_GPIO_AF_10  /*!< UART2   Alternate Function mapping */
#define LL_GPIO_AF10_LPTIM2       LL_GPIO_AF_10  /*!< LPTIM2  Alternate Function mapping */
#define LL_GPIO_AF10_LPUART2      LL_GPIO_AF_10  /*!< LPUART2 Alternate Function mapping */
/**
  * @brief   AF 11 selection
  */
#define LL_GPIO_AF11_USART2       LL_GPIO_AF_11  /*!< USART2  Alternate Function mapping */
#define LL_GPIO_AF11_TIM3         LL_GPIO_AF_11  /*!< TIM3    Alternate Function mapping */
#define LL_GPIO_AF11_SPI1         LL_GPIO_AF_11  /*!< SPI1    Alternate Function mapping */
#define LL_GPIO_AF11_I2S1         LL_GPIO_AF_11  /*!< I2S1    Alternate Function mapping */
#define LL_GPIO_AF11_USART1       LL_GPIO_AF_11  /*!< USART1  Alternate Function mapping */
#define LL_GPIO_AF11_SPI2         LL_GPIO_AF_11  /*!< SPI2    Alternate Function mapping */
#define LL_GPIO_AF11_I2S2         LL_GPIO_AF_11  /*!< I2S2    Alternate Function mapping */
#define LL_GPIO_AF11_TIM1         LL_GPIO_AF_11  /*!< TIM1    Alternate Function mapping */
#define LL_GPIO_AF11_UART1        LL_GPIO_AF_11  /*!< UART1   Alternate Function mapping */
#define LL_GPIO_AF11_FDCAN        LL_GPIO_AF_11  /*!< FDCAN   Alternate Function mapping */
#define LL_GPIO_AF11_LPTIM1       LL_GPIO_AF_11  /*!< LPTIM1  Alternate Function mapping */
#define LL_GPIO_AF11_LPUART1      LL_GPIO_AF_11  /*!< LPUART1 Alternate Function mapping */
#define LL_GPIO_AF11_LPUART2      LL_GPIO_AF_11  /*!< LPUART2 Alternate Function mapping */
/**
  * @brief   AF 12 selection
  */
#define LL_GPIO_AF12_COMP2        LL_GPIO_AF_12  /*!< COMP2   Alternate Function mapping */
#define LL_GPIO_AF12_TIM2         LL_GPIO_AF_12  /*!< TIM2    Alternate Function mapping */
#define LL_GPIO_AF12_LPTIM2       LL_GPIO_AF_12  /*!< LPTIM2  Alternate Function mapping */
#define LL_GPIO_AF12_TIM1         LL_GPIO_AF_12  /*!< TIM1    Alternate Function mapping */
#define LL_GPIO_AF12_TIM15        LL_GPIO_AF_12  /*!< TIM15   Alternate Function mapping */
#define LL_GPIO_AF12_PWM          LL_GPIO_AF_12  /*!< PWM     Alternate Function mapping */
#define LL_GPIO_AF12_LPUART1      LL_GPIO_AF_12  /*!< LPUART1 Alternate Function mapping */
#define LL_GPIO_AF12_LPTIM1       LL_GPIO_AF_12  /*!< LPTIM1  Alternate Function mapping */
#define LL_GPIO_AF12_LPUART2      LL_GPIO_AF_12  /*!< LPUART2 Alternate Function mapping */
#define LL_GPIO_AF12_UART1        LL_GPIO_AF_12  /*!< UART1   Alternate Function mapping */
#define LL_GPIO_AF12_SPI1         LL_GPIO_AF_12  /*!< SPI1    Alternate Function mapping */
#define LL_GPIO_AF12_I2S1         LL_GPIO_AF_12  /*!< I2S1    Alternate Function mapping */
#define LL_GPIO_AF12_COMP1        LL_GPIO_AF_12  /*!< COMP1   Alternate Function mapping */
/**
  * @brief   AF 13 selection
  */
#define LL_GPIO_AF13_PWM          LL_GPIO_AF_13  /*!< PWM    Alternate Function mapping */
#define LL_GPIO_AF13_TIM17        LL_GPIO_AF_13  /*!< TIM17  Alternate Function mapping */
#define LL_GPIO_AF13_USART2       LL_GPIO_AF_13  /*!< USART2 Alternate Function mapping */
#define LL_GPIO_AF13_TIM15        LL_GPIO_AF_13  /*!< TIM15  Alternate Function mapping */
#define LL_GPIO_AF13_TIM1         LL_GPIO_AF_13  /*!< TIM1   Alternate Function mapping */
#define LL_GPIO_AF13_USART1       LL_GPIO_AF_13  /*!< USART1 Alternate Function mapping */
#define LL_GPIO_AF13_SPI1         LL_GPIO_AF_13  /*!< SPI1   Alternate Function mapping */
#define LL_GPIO_AF13_I2S1         LL_GPIO_AF_13  /*!< I2S1   Alternate Function mapping */
#define LL_GPIO_AF13_PVD          LL_GPIO_AF_13  /*!< PVD    Alternate Function mapping */
#define LL_GPIO_AF13_UART2        LL_GPIO_AF_13  /*!< UART2  Alternate Function mapping */
#define LL_GPIO_AF13_I2C2         LL_GPIO_AF_13  /*!< I2C2   Alternate Function mapping */
#define LL_GPIO_AF13_TIM3         LL_GPIO_AF_13  /*!< TIM3   Alternate Function mapping */

/**
  * @brief   AF 14 selection
  */
#define LL_GPIO_AF14_IR           LL_GPIO_AF_14  /*!< IR     Alternate Function mapping */
#define LL_GPIO_AF14_PVD          LL_GPIO_AF_14  /*!< PVD    Alternate Function mapping */
#define LL_GPIO_AF14_LPTIM1       LL_GPIO_AF_14  /*!< LPTIM1 Alternate Function mapping */
#define LL_GPIO_AF14_LPTIM2       LL_GPIO_AF_14  /*!< LPTIM2 Alternate Function mapping */
#define LL_GPIO_AF14_RTC          LL_GPIO_AF_14  /*!< RTC    Alternate Function mapping */
#define LL_GPIO_AF14_TIM1         LL_GPIO_AF_14  /*!< TIM1   Alternate Function mapping */
#define LL_GPIO_AF14_PWM          LL_GPIO_AF_14  /*!< PWM    Alternate Function mapping */
#define LL_GPIO_AF14_UART2        LL_GPIO_AF_14  /*!< UART2  Alternate Function mapping */
#define LL_GPIO_AF14_TIM17        LL_GPIO_AF_14  /*!< TIM17  Alternate Function mapping */
/**
  * @brief   AF 15 selection
  */
#define LL_GPIO_AF15_IR           LL_GPIO_AF_15  /*!< IR Alternate Function mapping*/
#define LL_GPIO_AF15_EVENTOUT     LL_GPIO_AF_15  /*!< IR Alternate Function mapping*/

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup GPIO_LL_Exported_Macros GPIO Exported Macros
  * @{
  */

/** @defgroup GPIO_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in GPIO register
  * @param  __INSTANCE__ GPIO Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_GPIO_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in GPIO register
  * @param  __INSTANCE__ GPIO Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_GPIO_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup GPIO_LL_Exported_Functions GPIO Exported Functions
  * @{
  */

/** @defgroup GPIO_LL_EF_Port_Configuration Port Configuration
  * @{
  */

/**
  * @brief  Configure gpio mode for a dedicated pin on dedicated port.
  * @note   I/O mode can be Input mode, General purpose output, Alternate function mode or Analog.
  * @note   Warning: only one pin can be passed as parameter.
  * @rmtoll MODER        MODEy         LL_GPIO_SetPinMode
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_MODE_INPUT
  *         @arg @ref LL_GPIO_MODE_OUTPUT
  *         @arg @ref LL_GPIO_MODE_ALTERNATE
  *         @arg @ref LL_GPIO_MODE_ANALOG
  * @retval None
  */
__STATIC_INLINE void LL_GPIO_SetPinMode(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t Mode)
{
  MODIFY_REG(GPIOx->MODER, ((Pin * Pin) * GPIO_MODER_MODE0), ((Pin * Pin) * Mode));
}

/**
  * @brief  Return gpio mode for a dedicated pin on dedicated port.
  * @note   I/O mode can be Input mode, General purpose output, Alternate function mode or Analog.
  * @note   Warning: only one pin can be passed as parameter.
  * @rmtoll MODER        MODEy         LL_GPIO_GetPinMode
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GPIO_MODE_INPUT
  *         @arg @ref LL_GPIO_MODE_OUTPUT
  *         @arg @ref LL_GPIO_MODE_ALTERNATE
  *         @arg @ref LL_GPIO_MODE_ANALOG
  */
__STATIC_INLINE uint32_t LL_GPIO_GetPinMode(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
  return (uint32_t)(READ_BIT(GPIOx->MODER, ((Pin * Pin) * GPIO_MODER_MODE0)) / (Pin * Pin));
}

/**
  * @brief  Configure gpio output type for several pins on dedicated port.
  * @note   Output type as to be set when gpio pin is in output or
  *         alternate modes. Possible type are Push-pull or Open-drain.
  * @rmtoll OTYPER       OTy           LL_GPIO_SetPinOutputType
  * @param  GPIOx GPIO Port
  * @param  PinMask This parameter can be a combination of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  *         @arg @ref LL_GPIO_PIN_ALL
  * @param  OutputType This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_OUTPUT_PUSHPULL
  *         @arg @ref LL_GPIO_OUTPUT_OPENDRAIN
  * @retval None
  */
__STATIC_INLINE void LL_GPIO_SetPinOutputType(GPIO_TypeDef *GPIOx, uint32_t PinMask, uint32_t OutputType)
{
  MODIFY_REG(GPIOx->OTYPER, PinMask, (PinMask * OutputType));
}

